app/views/shopping_lists/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 5]]
---
			<% @recipes.each do |recipe| %>
				<% recipe.ingredients.each do |ingredient| %>