app/controllers/recipe_on_shopping_lists_controller.rb

SELECT id FROM "recipes" WHERE "recipes"."yummly_id" = 'Onion-Rings-Martha-Stewart_2'
---
	def create
		recipe_on_shopping_list = RecipeOnShoppingList.new(:shopping_list_id => params[:shopping_list_id])
		recipe = Recipe.where(:yummly_id => params[:yummly_id])