app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("created_at", "updated_at", "yummly_id") VALUES (?, ?, ?)  [["created_at", Fri, 13 Dec 2013 04:37:28 UTC +00:00], ["updated_at", Fri, 13 Dec 2013 04:37:28 UTC +00:00], ["yummly_id", "Broccoli-cheddar-scramble-recipe-306299"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."yummly_id" = 'Broccoli-cheddar-scramble-recipe-306299' AND "recipes"."name" = 'Broccoli Cheddar Scramble Recipe' AND "recipes"."url" = 'http://www.foodrepublic.com/2012/01/07/broccoli-cheddar-scramble-recipe' ORDER BY "recipes"."id" ASC LIMIT 1
UPDATE "recipes" SET "name" = ?, "url" = ?, "updated_at" = ? WHERE "recipes"."id" = 1  [["name", "Broccoli Cheddar Scramble Recipe"], ["url", "http://www.foodrepublic.com/2012/01/07/broccoli-cheddar-scramble-recipe"], ["updated_at", Fri, 13 Dec 2013 04:37:28 UTC +00:00]]
INSERT INTO "ingredients" ("created_at", "recipe_id", "show_on_list", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 14 Dec 2013 23:20:01 UTC +00:00], ["recipe_id", 6], ["show_on_list", true], ["updated_at", Sat, 14 Dec 2013 23:20:01 UTC +00:00]]
---
	def create
		recipe = Recipe.where(:yummly_id => params[:yummly_id], :name => params[:name], :url => params[:url]).first_or_create
		recipe.save

		# loop through recipes array to do below
		ingredients = params[:ingredient]
		@inspection = ingredients.inspect

		if recipe.save
			ingredients.each do |ingredient|
				ingredient = Ingredient.where(:name => ingredient[:ing_name], :recipe_id => Recipe.select(:id).last, :show_on_list => true).first_or_create