app/controllers/shopping_lists_controller.rb

SELECT "shopping_lists".* FROM "shopping_lists" WHERE (user_id = #<User:0x00000003ff0980>)
---
	def index

		@user_id = current_user
		@shopping_lists = ShoppingList.where(user_id: @user_id)

INSERT INTO "shopping_lists" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 13 Dec 2013 03:59:46 UTC +00:00], ["name", "Test List 2"], ["updated_at", Fri, 13 Dec 2013 03:59:46 UTC +00:00]]
---
	def create
		yummly_id = params[:recipe => yummly_id]
		user = current_user
		shopping_list = ShoppingList.where(:name => params[:name], :user_id => user.id).first_or_create

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@page_title = "Shopping list"
		@page_class = "shopping-list"
		@shopping_list = ShoppingList.find(params[:id])