app/controllers/users_controller.rb

SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."user_id" = 1
---
	def show
		@user = current_user

		@shopping_lists = ShoppingList.where(user_id: @user.id)